7767517
128 142
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 542 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864
Clip             Clip_1                   1 1 542 375 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_2                   1 1 375 545 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_3                   1 1 545 378 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_4                   1 1 378 548 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_5                   1 1 548 551 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             Clip_6                   1 1 551 383 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_7                   1 1 383 554 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_8                   1 1 554 386 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_9                   1 1 386 557 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 557 557_splitncnn_0 557_splitncnn_1
Convolution      Conv_10                  1 1 557_splitncnn_1 560 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_11                  1 1 560 391 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_12                  1 1 391 563 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_13                  1 1 563 394 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_14                  1 1 394 566 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_15                   2 1 557_splitncnn_0 566 397 0=0
Convolution      Conv_16                  1 1 397 569 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_17                  1 1 569 400 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_18                  1 1 400 572 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_19                  1 1 572 403 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_20                  1 1 403 575 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_1              1 2 575 575_splitncnn_0 575_splitncnn_1
Convolution      Conv_21                  1 1 575_splitncnn_1 578 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_22                  1 1 578 408 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_23                  1 1 408 581 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_24                  1 1 581 411 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_25                  1 1 411 584 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_26                   2 1 575_splitncnn_0 584 414 0=0
Split            splitncnn_2              1 2 414 414_splitncnn_0 414_splitncnn_1
Convolution      Conv_27                  1 1 414_splitncnn_1 587 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_28                  1 1 587 417 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_29                  1 1 417 590 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_30                  1 1 590 420 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_31                  1 1 420 593 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_32                   2 1 414_splitncnn_0 593 423 0=0
Split            splitncnn_3              1 2 423 423_splitncnn_0 423_splitncnn_1
Convolution      Conv_33                  1 1 423_splitncnn_1 596 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_34                  1 1 596 426 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_35                  1 1 426 599 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_36                  1 1 599 429 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_37                  1 1 429 602 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_4              1 2 602 602_splitncnn_0 602_splitncnn_1
Convolution      Conv_38                  1 1 602_splitncnn_1 605 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_39                  1 1 605 434 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_40                  1 1 434 608 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_41                  1 1 608 437 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_42                  1 1 437 611 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_43                   2 1 602_splitncnn_0 611 440 0=0
Split            splitncnn_5              1 2 440 440_splitncnn_0 440_splitncnn_1
Convolution      Conv_44                  1 1 440_splitncnn_1 614 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_45                  1 1 614 443 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_46                  1 1 443 617 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_47                  1 1 617 446 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_48                  1 1 446 620 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_49                   2 1 440_splitncnn_0 620 449 0=0
Split            splitncnn_6              1 2 449 449_splitncnn_0 449_splitncnn_1
Convolution      Conv_50                  1 1 449_splitncnn_1 623 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_51                  1 1 623 452 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_52                  1 1 452 626 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_53                  1 1 626 455 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_54                  1 1 455 629 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_55                   2 1 449_splitncnn_0 629 458 0=0
Convolution      Conv_56                  1 1 458 632 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_57                  1 1 632 461 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_58                  1 1 461 635 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_59                  1 1 635 464 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_60                  1 1 464 638 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_7              1 2 638 638_splitncnn_0 638_splitncnn_1
Convolution      Conv_61                  1 1 638_splitncnn_1 641 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_62                  1 1 641 469 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_63                  1 1 469 644 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_64                  1 1 644 472 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_65                  1 1 472 647 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_66                   2 1 638_splitncnn_0 647 475 0=0
Split            splitncnn_8              1 2 475 475_splitncnn_0 475_splitncnn_1
Convolution      Conv_67                  1 1 475_splitncnn_1 650 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_68                  1 1 650 478 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_69                  1 1 478 653 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_70                  1 1 653 481 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_71                  1 1 481 656 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_72                   2 1 475_splitncnn_0 656 484 0=0
Split            splitncnn_9              1 2 484 484_splitncnn_0 484_splitncnn_1
Convolution      Conv_73                  1 1 484_splitncnn_1 659 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_74                  1 1 659 487 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_75                  1 1 487 662 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_76                  1 1 662 490 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_77                  1 1 490 665 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_10             1 2 665 665_splitncnn_0 665_splitncnn_1
Convolution      Conv_78                  1 1 665_splitncnn_1 668 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_79                  1 1 668 495 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 495 671 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_81                  1 1 671 498 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_82                  1 1 498 674 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_83                   2 1 665_splitncnn_0 674 501 0=0
Split            splitncnn_11             1 2 501 501_splitncnn_0 501_splitncnn_1
Convolution      Conv_84                  1 1 501_splitncnn_1 677 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_85                  1 1 677 504 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_86                  1 1 504 680 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_87                  1 1 680 507 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_88                  1 1 507 683 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_89                   2 1 501_splitncnn_0 683 510 0=0
Convolution      Conv_90                  1 1 510 686 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_91                  1 1 686 513 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_92                  1 1 513 689 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=8640 7=960
Clip             Clip_93                  1 1 689 516 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_94                  1 1 516 692 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Convolution      Conv_95                  1 1 692 695 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=40960
ReLU             Relu_96                  1 1 695 521
DeconvolutionDepthWise ConvTranspose_97         1 1 521 522 0=128 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=512 7=128
BatchNorm        BatchNormalization_98    1 1 522 523 0=128
ReLU             Relu_99                  1 1 523 524
Convolution      Conv_100                 1 1 484_splitncnn_0 698 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
ReLU             Relu_101                 1 1 698 527
BinaryOp         Add_102                  2 1 524 527 528 0=0
DeconvolutionDepthWise ConvTranspose_103        1 1 528 529 0=128 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=512 7=128
BatchNorm        BatchNormalization_104   1 1 529 530 0=128
ReLU             Relu_105                 1 1 530 531
Convolution      Conv_106                 1 1 423_splitncnn_0 701 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_107                 1 1 701 534
BinaryOp         Add_108                  2 1 531 534 535 0=0
Convolution      Conv_109                 1 1 535 704 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_110                 1 1 704 538
Split            splitncnn_12             1 3 538 538_splitncnn_0 538_splitncnn_1 538_splitncnn_2
Convolution      Conv_111                 1 1 538_splitncnn_2 539 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
Convolution      Conv_112                 1 1 538_splitncnn_1 540 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      Conv_113                 1 1 538_splitncnn_0 541 0=2 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
